'''
# super 关键字
    # 在py3中怎么用？在py2(新式类和经典类)中怎么用？
    # 在单继承中执行父类的同名方法的时候怎么用？
    # super()方法和mro() 方法的关系是什么？
# 封装
    # 广义上的封装
    # 狭义上的封装
        # 是有私有的三种情况
            # 不想让你看也不想让你改
            # 可以让你看，但不让你改
            # 可以看也可以改，但是要求你按照我的规则改
        # 封装的语法
            # 私有的静态变量
            # 私有的实例变量
            # 私有的绑定方法
        # 私有的特点
            # 能不能在类的内部使用？
            # 能不能在类的外部使用？
            # 能不能在类的子类中使用？
        # 原理
            # 如何变形？ _类名__私有属性或方法
            # 在哪里用的时候变形？
        # 类中变量的级别，哪些是python支持的，哪些是python不支持的？
            # 公有的    public
            # 受保护的  protect
            # 私有的    private

# 类中的三个装饰器(内置函数)
# property
# classmethod
# staticmethod

# 反射
'''