# 实现能计算类似 等类似公式的计算器程序
exp = 1 - 2 * ( (60-30 +(-40/5) * (9-2*5/3 + 7 /3*99/4*2998 +10 * 568/14 )) - (-4*3)/ (16-3*2) )

'''
思路:
先匹配小括号里的内容
然后先计算乘除法
在计算加减法

用循环用正则
调用函数
'''
import  re
# ret=re.findall(r"\d+\.\d+|(\d+)","1-2*(60+(-40.35/5)-(-4*3))")
# print(ret) # ['1', '2', '60', '', '5', '4', '3'] # 通过分组过滤 小数
# ret = filter(lambda n:n, ret)  # 通过filter过滤空
# print(list(ret)) # ['1', '2', '60', '5', '4', '3']
exp = 1 - 2 * ( (60-30 +(-40/5) * (9-2*5/3 + 7 /3*99/4*2998 +10 * 568/14 )) - (-4*3)/ (16-3*2) )
reg = '(()())'
print(re.findall(reg, str(exp)))