# 1.操作系统的作用?
#
# ​	操作系统是管理计算机内存的配置与分配,对计算机资源的供需进行分配,控制输入输出设	备的一种软件
#
# 2.python是什么类型的语言?
#
# ​	python是一种解释型语言
#
# 3.解释一下你理解的编译型,和解释型语言
#
# ​	编译型:计算机运行前将程序全部编译后才运行的语言
#
# ​	解释型:计算机通过虚拟机边编译边运行的语言
#
# 4.补充代码,实现以下功能:
#
# ```python
# value = "alex"
# print(value)

# print(value) #输出结果是 alex
# ```
#
# 5.简述变量命名规范
# 1.使用数字,字母,下划线组成
# 2.不能使用数字开头,更不能全数字,也不能有特殊符号
# 3.见名知意
# 4.最好使用驼峰体或者下划线格式
#
# 6、用print打印出下面内容：
#
# ```python
# s = '''
#        文能提笔安天下,
#        武能上马定乾坤.
#        心存谋略何人胜,
#        古今英雄唯是君.
#        '''
# print(s)
#
# ```
#
# 7.name = input(">>>") name变量是什么数据类型？用代码实现
#
# ​
#
# ```python
# name = input(">>>")
# print(type(name))
# ```
#
# ​	由输出可知name变量的数据类型是str即字符串类型
#
# 8.补充代码
#
# ```python
# name = "周杰伦"
# name1 = "林俊杰"
# name2 = _"周杰伦"______
# name = "张学友"
# print(name,name1,name2)
# 结果: 张学友,林俊杰,周杰伦
# ```
#
# 9.简述你了解的if条件语句的基本结构
'''
单分支 if 
多分支 if elif else
嵌套分支 
if a > 1:
    if b = 1:
        pass
else:
    pass
'''
# 10.设定一个固定年龄比如：66，让用户输入数字，如果比66大，则显示猜测的结果大了；如果比66小，则显示猜测的结果小了;只有等于66，显示猜测结果正确。
# age = int(input("请输入年龄："))
# if age > 66:
#     print("猜大了")
# elif age < 66:
#     print("猜小了")
# else:
#     print("猜对了")

# 11.提⽰⽤户输入⿇花藤. 判断⽤户输入的对不对. 如果对, 提⽰真聪明, 如果不对, 提⽰你 是傻逼么

# username = input("输入马化腾：")
# if username != "麻花腾":
#     print("傻逼吗？")
# else:
#     print("真聪明")

# 12.让用户输入 姓名,年龄 然后输出以下结果:
#
# ```
# 我叫:Alex 我今年:18岁
# ```
# while 1:
#     name = input("姓名：")
#     if name == "":
#         break
#     age = input("年龄：")
#     print("我叫%s,我今年%s岁" %(name, age))

#
