'''
# 网编：
    # 概念：osi7层模型/5层模型/各层协议/物理设备 (重要)
        # tcp(三次握手\四次挥手)/udp
    # 代码：
        # tcp - socket
            # 粘包问题
        # udp - socket
        # socketserver
            # tcp协议的粘包问题


# 解决粘包问题的上传大文件
    # recv(n) 并不表示一定能接收到n
# 验证客户端的合法性
    # 什么场景？一定是在公司内部无用户的情况下(没人能看得见我们的client端代码的时候)
    # 有人的情况下，就直接登陆即可
# 并发socketserver tcp协议的server
    # 把模版背下来
    # 把其他的逻辑移植到handle方法里

# 学数据库之前的大作业布置:ftp

# 三次登陆
# 购物车
# 员工信息      字符串 文件 逻辑能力
# 计算器       函数和循环
# 选课系统     面向对象 反射
# 网盘ftp     网络编程 + 上面所有

# 密文登陆
    # server  userinfo 密文
    # clietn input明文密码
    # 至少要在server端进行一次摘要
'''

